backend/app/controllers/tasks_controller.rb

    task = Task.create!(title: title, sort_order: sort_order)
---
INSERT INTO "tasks" ("title", "sort_order", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Sample task\n"], ["sort_order", 1], ["created_at", "2017-07-17 01:01:09.100978"], ["updated_at", "2017-07-17 01:01:09.100978"]]